[{"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "(more)           Narendra Modi  prime minister of India    Ask Anything  Quick Summary  Homework Help Also known as: Narendra Damodardas Modi      Written by     Shanthie Mariet D'Souza Research Fellow, Institute of South Asian Studies, National University of Singapore, Singapore.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "18,000 villages that were without electricity even after 70 long years of Independence have been electrified.  Various path breaking initiatives like PM KISAN, Soil Health Cards, E-NAM etc have helped India to move towards sustainable agriculture.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://www.pmindia.gov.in/en/", "text": "Access Denied  Access Denied   You don't have permission to access \"http://www.pmindia.gov.in/en/\" on this server.", "source": "Prime Minister of India"}, {"url": "https://www.pmindia.gov.in/en/pms-profile/", "text": "Access Denied  Access Denied   You don't have permission to access \"http://www.pmindia.gov.in/en/pms-profile/\" on this server.", "source": "Know the PM | Prime Minister of India"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "Download MyGov Mobile App And Continue to Contribute Towards Building a New India on the Move          Copyright © MyGov 2014 Last Updated: Feb, 2026 -    aexa-01", "source": "PM Events – Prime Minister of India"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Editor of Countering Insurgencies and Violent Extremism in South and South East Asia.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "External Websites                    Official Site of Prime Minister of India CNN - Narendra Modi: Indiaï¿½s popular but controversial leader seeking a transformative third term   Britannica Websites Articles from Britannica Encyclopedias for elementary and high school students.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Feedback Type  Select a type (Required) Factual Correction Spelling/Grammar Correction Link Correction Additional Information Other   Your Feedback  Submit Feedback   Thank you for your feedback Our editors will review what you’ve submitted and determine whether to revise the article.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "For other uses, see Modi (disambiguation) and Namo (disambiguation).", "source": "Narendra Modi - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "For the 2019 film, see PM Narendra Modi (film).", "source": "Narendra Modi - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "For the TV series, see Pradhanmantri (TV series) and Pradhan Mantri (TV series).", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "Further, PM Jan Dhan scheme has widened banking net to poor and has ensured financial inclusion.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014.", "source": "PM Events – Prime Minister of India"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "He is a member of the Bharatiya Janata Party (BJP) and of the Rashtriya Swayamsevak Sangh (RSS), a right-wing Hindutva paramilitary volunteer organisation.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "He is the longest-serving prime minister outside the Indian National Congress.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "Implementation of welfare programs as a mass movement has been key to his citizen centric governance for ‘Ease of Living’.  Under his visionary leadership India is home to the world’s largest healthcare programme, Ayushman Bharat.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "In the 2014 and 2019 Parliamentary elections, Shri Modi led the Bharatiya Janata Party to record wins, securing absolute majority on both occasions.", "source": "PM Events – Prime Minister of India"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "India has made significant improvement in ‘Ease of Doing Business’.  PM Modi is deeply passionate about environmental causes.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Jaishankar  Minister of State Kirti Vardhan Singh Pabitra Margherita  Foreign Secretary Vinay Mohan Kwatra  Diplomatic missions of / in India Ambassadors and High Commissioners of India / to India  Nationality law Overseas Citizenship Passports Visa policy Visa requirements Foreign Relations 2+2 BIMSTEC BBIN BRICS Commonwealth G4 G20 IBSA IONS IORA MGC Non-Aligned Movement SAARC SCO United Nations QUAD  Africa East Asia European Union Latin America Pacific Islands  Diaspora History Extradition Treaties Foreign aid by India / to India Sanctions State Visits by Indian Prime Ministers State Visits to India  Kashmir Conflict Indo-Pakistani Wars Sino-Indian Disputes Disputes with Nepal Foreign Policy ITEC Look East policy Pan-African e-Network project Indira Gandhi Narendra Modi   India portal  Other countries vte The prime minister of India (ISO: Bhārat kē Pradhānamantrī) is the head of government[2] of the Republic of India.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "JamirKamla Beniwal Preceded byKeshubhai PatelSucceeded byAnandiben PatelMember of the Gujarat Legislative AssemblyIn office15 December 2002 – 16 May 2014Preceded byKamlesh PatelSucceeded bySuresh PatelConstituencyManinagarIn office24 February – 19 July 2002 (2002-02-24 – 2002-07-19)Preceded byVajubhai ValaSucceeded byVajubhai ValaConstituencyRajkot IIGeneral Secretary (Organisation) of the Bharatiya Janata PartyIn office5 January 1998[1] – 7 October 2001Preceded byKushabhau ThakreSucceeded bySanjay Joshi Personal detailsBornNarendra Damodardas Modi (1950-09-17) 17 September 1950 (age 75)Vadnagar, Bombay State, IndiaPartyBharatiya Janata Party (since 1985)Spouse Jashodaben Modi ​ ​(m. 1968; sep. 1971)​[2]Residence(s)7, Lok Kalyan Marg, New DelhiAlma materUniversity of Delhi (BA)Gujarat University (MA)AwardsList of awards and honoursSignatureWebsitePersonalPM India official   Narendra Modi's voice  Modi on the COVID-19 pandemicRecorded 19 March 2020    This article is part ofa series aboutNarendra Modi  Prime Minister of IndiaIncumbent Electoral history Public image Awards and honours Eponyms Bibliography  Chief Ministership   Chief Minister of Gujarat2001–2014 Assembly elections 2002 2007 2012 Gujarat Council of Ministers Modi I Modi II Modi III Modi IV Gujarat Legislative Assembly Tenth Eleventh Twelfth Thirteenth  Premiership(Timeline)   Assassination attempt General elections 2014 campaign 2019 campaign 2024 campaign Oath of office 2014 2019 2024 Union Council of Ministers Modi I Modi II reshuffle Modi III Lok Sabha Sixteenth Seventeenth Eighteenth Mann Ki Baat episodes International trips Approval ratings Protests Security breach  Budgets   Union budgets 2014 2015 2016 2017 2018 2019 (interim) 2019 2020 2021 2022 2023 2024 (interim) 2024 2025 Railway budgets 2014 2015 2016  Constitutional amendments   99th 100th 101st 102nd 103rd 104th 105th 106th  National policy  Agriculture: Agriculture acts Atal Bhujal E-NAM Fasal Bima Gramin Bhandaran Kisan Samman Nidhi Krishi Sinchai Mega Food Parks PM-AASHA PM-KUSUM Digital: Aarogya Setu BharatNet DigiLocker ESign UMANG Economy: Banknote demonetisation Goods and Services Tax Jan Dhan MUDRA Bank Multi-Modal Logistics Parks Unified Pension Scheme Energy: Saubhagya Ujjwala Ultra Mega Solar Power Urja Ganga Gas Pipeline Infrastructure: Bharat Mandapam Awas Central Vista Kandla–Gorakhpur LPG Pipeline Kartavya Bhavan National War Memorial New Parliament House Pradhan Mantri Gati Shakti Pradhanmantri Sangrahalaya Statue of Subhas Chandra Bose Statue of Unity Vice President's Enclave Yashobhoomi Policy: National Education Policy National Register of Citizens One Nation, One Election Repeal of Article 370 and 35A Uniform Civil Code Other public services: Garib Kalyan Har Ghar Jal Post Office Passport Seva Kendra Stranded in India Transport - Aviation: UDAN Transport - Rail: Bhanupli–Leh Railway Char Dham Railway High-speed rails Setu Bharatam Transport - Road: Arunachal East-West Corridor Arunachal Frontier Highway Bharatmala Char Dham Highway Delhi–Amritsar–Katra Expressway Delhi–Mumbai Expressway FASTag India-China Border Roads Trans-Arunachal Highway Transport - Water: RORO ferries Sagarmala  Campaigns   Economy: Atmanirbhar Bharat Digital India Give up LPG subsidy Know India Make in India Skill India Standup India Startup India Swachh Bharat Swachh Dhan Unnat Bharat Health: Ayushman Bharat Fit India Public service: Accessible India  Missions   Bharatiya Khel Atal Mission for Rejuvenation and Urban Transformation Mission Indradhanush National Solar Mission PM-SHRI Smart Cities Smart Villages  Establishments and foundations   Bharatiya Nagarik Suraksha Sanhita Bharatiya Nyaya Sanhita Bharatiya Shiksha Board MyGov.in National Creators Award NITI Aayog New Parliament House PM CARES Fund Pradhanmantri Sangrahalaya Prime Minister's Yoga Awards Sansad TV Sardar Patel National Unity Award Shri Ram Janmabhoomi Teerth Kshetra Smritivan Earthquake Memorial and Museum Veer Balak Smarak Young Scientist Labs  Events and observances   75th Anniversary of Indian Independence Amritpex Bharat Parv Good Governance Day Janjatiya Gaurav Divas Khelo India Krishi Unnati Mela National Unity Day Pariksha Pe Charcha Partition Horrors Remembrance Day  Military and rescue operations   2014–15 India–Pakistan border skirmishes 2016–18 India–Pakistan border skirmishes 2019 India–Pakistan border skirmishes 2020–21 India–Pakistan border skirmishes 2023 India–Pakistan border skirmishes Army operations in Jammu and Kashmir Doklam standoff Galwan Valley standoff Jammu and Kashmir floods rescue operations Operation Black Forest Operation Madad  Treaties and accords   Bodo Peace Accord Nagaland Peace Accord Tripura Peace Accord   Foreign policy  Asian Act East Central Asian Middle Eastern De-hyphenation Strategic autonomy Project Mausam Security and Growth for All in the Region Nepal blockade Vaccine Maitri Canada–India diplomatic row India and the Russian invasion of Ukraine India–Maldives diplomatic row India–Pakistan crisis India–United states diplomatic and trade crisis  Establishments and foundations   2+2 Ministerial Dialogue Coalition for Disaster Resilient Infrastructure Delhi–Kathmandu Bus India–Pacific Islands Forum Global Biofuel Alliance India–Middle East–Europe Economic Corridor India–United States Defense Acceleration Ecosystem Indo-Abrahamic Alliance International Solar Alliance Kartarpur Corridor New Development Bank SAARC COVID-19 Emergency Fund South Asia Satellite United States–India Initiative on Critical and Emerging Technology World Hindi Secretariat  Events and observances   Howdy Modi International Yoga Day International Year of Millets Namaste Trump 75 Years of Friendship through Cricket Event  Military and rescue operations   Balakot airstrike India–Pakistan missile incident Line of Control strike Operation Abhyas Indian strikes in Myanmar Operation Ajay Operation Brahma Operation Devi Shakti Operation Dost Operation Ganga Operation Hot Pursuit Operation Insaniyat Operation Kaveri Operation Maitri Operation Namaste Operation Neer Operation Raahat Operation Sankat Mochan Operation Sindhu Operation Sindoor Operation Sunrise  Treaties and accords   Australia–India Economic Cooperation Agreement India–Bangladesh Boundary Agreement Economic and Technology Cooperation Agreement India-United States Exchange Cooperation Agreement Paris Agreement India–United Kingdom Free Trade Agreement   Controversies  Gujarat riots Indian writers' protest Banknote demonetisation Rafale deal controversy Pegasus Project revelations Repeal of Article 370 and 35A Citizenship Amendment Act protests COVID-19 lockdown in India 2020–2021 Indian farmers' protest 2024 Indian farmers' protest 2025 electoral controversy    Media related to Narendra Modi at Wikimedia Commonsvte Narendra Damodardas Modi[a] (born 17 September 1950) is an Indian politician who has served as the  prime minister of India since 2014.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "Know the PM  NARENDRA MODI PRIME MINISTER OF INDIA \"Dynamic, dedicated and determined, Narendra Modi arrives as a ray of hope in the lives of a billion Indians.\" Shri Narendra Modi was sworn-in as India’s Prime Minister on 30th May 2019, marking the start of his second term in office.", "source": "PM Events – Prime Minister of India"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Let us know if you have suggestions to improve this article (requires login).", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Modi became the prime minister of India in 2014.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "Modi was born and raised in Vadnagar, Bombay State (present-day Gujarat), where he completed his secondary education.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "Modi was the chief minister of Gujarat from 2001 to 2014 and is the member of parliament (MP) for Varanasi.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Murugan  Law and judiciary Law of India Indian criminal law Bharatiya Nyaya Sanhita Bharatiya Nagarik Suraksha Sanhita Bharatiya Sakshya Adhiniyam  Code of Civil Procedure Supreme Court of India Chief Justice (List) Surya Kant  Judges Bar Association  Bar Council District Court List Gram Nyayalaya High Court Chief Justices Judges Lok Adalat Nyaya Panchayat Pendency of court cases Other tribunals Ministry of Law and Justice Minister Arjun Ram Meghwal  Attorney-General R.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://www.instagram.com/narendramodi/", "text": "Narendra Modi (@narendramodi) • Instagram photos and videos", "source": "Narendra Modi (@narendramodi) • Instagram photos and videos"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Narendra Modi - Student Encyclopedia (Ages 11 and up)                         Narendra Modi Chief minister of Gujarat state Narendra Modi speaking at the World Economic Forum's India Economic Summit, November 2008.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "Narendra Modi - Wikipedia                              Jump to content        Main menu      Main menu move to sidebar hide    \t\tNavigation \t   Main pageContentsCurrent eventsRandom articleAbout WikipediaContact us      \t\tContribute \t   HelpLearn to editCommunity portalRecent changesUpload fileSpecial pages                    Search            Search                       Appearance                 Donate  Create account  Log in         Personal tools      Donate Create account Log in                             Contents move to sidebar hide     (Top)      1 Early life and education         2 Early political career         3 Chief Minister of Gujarat (2001–2014)     Toggle Chief Minister of Gujarat (2001–2014) subsection      3.1 Taking office         3.2 2002 Gujarat violence         3.3 Later terms as chief minister         3.4 Development projects         3.5 Development debate           4 Premiership campaigns     Toggle Premiership campaigns subsection      4.1 2014 Indian general election         4.2 2019 Indian general election         4.3 2024 Indian general election           5 Prime Minister of India (2014–present)     Toggle Prime Minister of India (2014–present) subsection      5.1 Governance and other initiatives         5.2 Hindutva         5.3 Economy         5.4 Health and sanitation         5.5 Foreign policy         5.6 Defence         5.7 Environment         5.8 Democratic backsliding           6 Public perception and image     Toggle Public perception and image subsection      6.1 Image         6.2 Approval ratings         6.3 In popular culture           7 Awards and recognition         8 Electoral history         9 Writing career         10 Bibliography         11 See also         12 References     Toggle References subsection      12.1 Notes         12.2 Citations         12.3 Sources           13 Further reading         14 External links                   Toggle the table of contents        Narendra Modi    146 languages     AfrikaansअंगिकाالعربيةAragonésԱրեւմտահայերէնঅসমীয়াAsturianuअवधीAymar aruAzərbaycancaBasa Baliবাংলা閩南語 / Bân-lâm-gíБашҡортсаБеларускаяБеларуская (тарашкевіца)भोजपुरीBikol CentralБългарскиBrezhonegCatalàCebuanoČeštinaCorsuCymraegDanskDeutschދިވެހިބަސްडोटेलीEestiΕλληνικάEspañolEsperantoEuskaraفارسیFiji HindiFøroysktFrançaisFryskGaeilgeGalegoગુજરાતીगोंयची कोंकणी / Gõychi Konknni한국어HausaՀայերենहिन्दीHrvatskiIdoIgboBahasa IndonesiaInterlinguaInterlingueИронIsiZuluÍslenskaItalianoעבריתJawaಕನ್ನಡქართულიکٲشُرKernowekIkinyarwandaKiswahiliKreyòl ayisyenKurdîລາວLatinaLatviešuLëtzebuergeschLietuviųLingua Franca NovaLa .lojban.MagyarमैथिलीМакедонскиമലയാളംMaltiमराठीმარგალურიمصرىمازِرونیBahasa Melayuꯃꯤꯇꯩ ꯂꯣꯟМонголမြန်မာဘာသာNa Vosa VakavitiNederlandsनेपालीनेपाल भाषा日本語Norsk bokmålNorsk nynorskOccitanଓଡ଼ିଆOʻzbekcha / ўзбекчаਪੰਜਾਬੀپنجابیPapiamentuپښتوភាសាខ្មែរPolskiPortuguêsQırımtatarcaRomânăRuna SimiРусскийसंस्कृतम्ᱥᱟᱱᱛᱟᱲᱤScotsShqipසිංහලSimple EnglishسنڌيSlovenčinaSlovenščinaSoomaaligaکوردیСрпски / srpskiSrpskohrvatski / српскохрватскиSundaSuomiSvenskaTagalogதமிழ்TayalతెలుగుไทยТоҷикӣತುಳುTürkçeУкраїнськаاردوئۇيغۇرچە / UyghurcheVepsän kel’Tiếng ViệtWinaray吴语ייִדישYorùbá粵語Zazaki中文ꠍꠤꠟꠐꠤToki pona  Edit links            ArticleTalk      English                  ReadView sourceView history        Tools      Tools move to sidebar hide    \t\tActions \t   ReadView sourceView history      \t\tGeneral \t   What links hereRelated changesUpload filePermanent linkPage informationCite this pageGet shortened URLDownload QR code      \t\tPrint/export \t   Download as PDFPrintable version      \t\tIn other projects \t   Wikimedia CommonsWikinewsWikiquoteWikisourceWikidata item                       Appearance move to sidebar hide             From Wikipedia, the free encyclopedia    Prime Minister of India since 2014 \"Modi\" and \"NaMo\" redirect here.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Narendra Modi | Biography, Career, & Facts | Britannica                                                      Search Britannica      Click here to search            Search Britannica      Click here to search           SUBSCRIBE       SUBSCRIBE   Login  https://premium.britannica.com/premium-membership/?utm_source=premium&utm_medium=nav-login-box&utm_campaign=evergreen          SUBSCRIBE     Home History & Society Science & Tech Biographies Animals & Nature Geography & Travel Arts & Culture ProCon Money   Games & Quizzes Videos On This Day One Good Fact Dictionary New Articles  History & Society  Lifestyles & Social Issues Philosophy & Religion Politics, Law & Government World History  Science & Tech  Health & Medicine Science Technology  Biographies  Browse Biographies  Animals & Nature  Birds, Reptiles & Other Vertebrates Environment Fossils & Geologic Time Insects & Other Invertebrates Mammals Plants  Geography & Travel  Geography & Travel  Arts & Culture  Entertainment & Pop Culture Literature Sports & Recreation Visual Arts   Image Galleries Podcasts Summaries Top Questions Lists and Stories   Britannica Kids               Ask the Chatbot  Games & Quizzes  History & Society  Science & Tech  Biographies  Animals & Nature  Geography & Travel  Arts & Culture  ProCon  Money  Videos                             Narendra Modi           Introduction & Top QuestionsEarly life and political careerPolitical ascent and term as chief minister of GujaratPremiership  References & Edit History  Quick Facts & Related Topics    Images                                                             Politics, Law & Government    World Leaders    Prime Ministers          print \t\t\tPrint \t\t  \t\t\tPlease select which sections you would like to print: \t\t    Table Of Contents        \t\t\t         CITE \t\t    verifiedCite \t\t  \t\t\tWhile every effort has been made to follow citation style rules, there may be some discrepancies.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "Narendra Modi | World Bank Live                                                 Skip to Main Navigation          Live Event                    World Bank Live       Live Event                  WORLDBANK.ORG                 About   Browse All Events   By Topic   By Speaker    Global Search dropdown      Search              English   Français   Español                     About   Browse All Events   By Topic   By Speaker   SEARCH Global Search  SEARCH        \r \t\t\t\tlanguage\r \t\t\t\t     English   Français   Español                        Featured Speaker                          Narendra Modi Prime Minister of India Featured on:     PM Narendra Modi was sworn-in as the Prime Minister of India on 30th May 2019, marking the start of his second term in office.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "Narendra ModiOfficial portrait, 2025Prime Minister of IndiaIncumbentAssumed office 26 May 2014PresidentPranab MukherjeeRam Nath KovindDroupadi MurmuVice PresidentMohammad Hamid AnsariVenkaiah NaiduJagdeep DhankharC.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "PM Events – Prime Minister of India                                                                GOVERNMENT OF INDIA  Skip main content    हिन्दी English     Accessibility  Accessibility Tools  Color Adjustment   High contrast icon High Contrast Dark contrast icon Dark Contrast  Highlight Links  Text Size   Increase Text icon Increase Text Decrease Text iconDecrease Text Reset font size icon Reset Text Line Height Text Spacing  Navigation Adjustment   Big Cursor  Hide Image Screen Reader iconScreen Reader     Follow us   MyGov Twitter   MyGov Facebook   MyGov Youtube   MyGov Instagram   MyGov Linkedin   MyGov Whatsapp                 Search      Location  -- Select -- Andaman And Nicobar IslandsAndhra PradeshArunachal PradeshAssamBiharChandigarhChhattisgarhDelhiGoaGujaratHaryanaHimachal PradeshJammu And KashmirJharkhandKarnatakaKeralaLadakhLakshadweepMadhya PradeshMaharashtraManipurMeghalayaMizoramNagalandOdishaPuducherryPunjabRajasthanSikkimTamil NaduTelanganaThe Dadra And Nagar Haveli And Daman And DiuTripuraUttar PradeshUttarakhandWest Bengal   Events Date     Upcoming Events  Past Events                 Watch Now    Watch Now           1- Transfer of 21st installment to more than 9 Crore PM-KISAN beneficiaries2- Transfer of 20th installment to more than 9.7 Crore PM-KISAN beneficiaries3- Transfer of 19th installment to more than 9.7 Crore PM-KISAN beneficiaries4- PM-KISAN 18th Installment release by Hon’ble Prime Minister5- Distribution Sanction letters to 10 Lakh beneficiaries by Hon’ble Prime Minister6- PM-KISAN 17th release by Hon’ble Prime Minister7- PM-KISAN 16th release by Hon’ble Prime Minister      53115 Registered   0 Upcoming Events   7 Past Events    Currently, there are no Live/Upcoming events.", "source": "PM Events – Prime Minister of India"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "Platform is designed, developed and hosted by National Informatics Centre.", "source": "PM Events – Prime Minister of India"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Please refer to the appropriate style manual or other sources if you have any questions.", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://www.pmsangrahalaya.gov.in/prime-ministers-of-india", "text": "Pradhanmantri Sangrahalaya | Museum on Indian Prime Ministers   Loading...", "source": "PM Sangrahlaya - a Tribute to India's Prime Ministers"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Prime Minister (informal) His Excellency (diplomatic) TypeHead of governmentAbbreviationPMMember ofParliament of India  Union Council of Ministers Reports toThe PresidentThe Vice PresidentParliament of IndiaResidence7, Lok Kalyan Marg, New Delhi, Delhi, IndiaSeatSecretariat Building, New Delhi, Delhi, IndiaNominatorLok Sabha membersAppointerPresident of Indiaby convention, based on appointee's ability to command confidence in the Lok SabhaTerm lengthAt the pleasure of the presidentLok Sabha term is 5 years unless dissolved soonerNo term limits specifiedConstituting instrumentArticles 74 & 75, Constitution of IndiaPrecursorSecretary of State for India and Vice President of the Executive CouncilFormation15 August 1947; 78 years ago (1947-08-15)First holderJawaharlal NehruDeputyDeputy Prime MinisterSalary₹280,000 (US$3,300) (per month)[1]₹3,360,000 (US$40,000) (Annual)[1]Websitepmindia.gov.in Politics of India Constitution Amendment Basic structure doctrine Fundamental Rights, Directive Principles, and  Fundamental Duties Human rights Judicial review Taxation  Government President of India  (List) Droupadi Murmu  Vice President of India (List) C.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Prime Minister of India - Wikipedia                              Jump to content        Main menu      Main menu move to sidebar hide    \t\tNavigation \t   Main pageContentsCurrent eventsRandom articleAbout WikipediaContact us      \t\tContribute \t   HelpLearn to editCommunity portalRecent changesUpload fileSpecial pages                    Search            Search                       Appearance                 Donate  Create account  Log in         Personal tools      Donate Create account Log in                             Contents move to sidebar hide     (Top)      1 Origins and history     Toggle Origins and history subsection      1.1 1947–1984         1.2 1984–1999         1.3 2000–present         1.4 Party affiliation           2 Constitutional framework and position of Prime Minister         3 Appointment, tenure and removal     Toggle Appointment, tenure and removal subsection      3.1 Eligibility         3.2 Oaths of office and secrecy         3.3 Tenure and removal from office           4 Role and power of the prime minister     Toggle Role and power of the prime minister subsection      4.1 Prime Minister Administrative Structure of India         4.2 Executive powers       4.2.1 Administrative and appointment powers           4.3 Legislative powers           5 Languages of the Prime Minister's Office         6 Compensation and benefits     Toggle Compensation and benefits subsection      6.1 Residence         6.2 Travel         6.3 Protection         6.4 Office           7 Family         8 Post-premiership     Toggle Post-premiership subsection      8.1 Death         8.2 Commemoration           9 Prime ministerial funds     Toggle Prime ministerial funds subsection      9.1 National Defence Fund         9.2 Prime Minister's National Relief Fund         9.3 Prime Minister's Citizen Assistance and Relief in Emergency Situations Fund (PM Cares Fund)           10 Deputy Prime Minister         11 Oath of office         12 See also         13 Notes         14 References         15 List         16 External links                   Toggle the table of contents        Prime Minister of India    56 languages     العربيةঅসমীয়াবাংলাभोजपुरीБългарскиCatalàČeštinaCymraegDanskDeutschދިވެހިބަސްEestiΕλληνικάEspañolEsperantoفارسیFiji HindiFrançais한국어हिन्दीÍslenskaעבריתJawaಕನ್ನಡქართულიکٲشُرLatviešuमैथिलीМакедонскиമലയാളംमराठीმარგალურიمصرىBahasa Melayuनेपाली日本語Norsk nynorskଓଡ଼ିଆਪੰਜਾਬੀپنجابیPolskiPortuguêsРусскийसंस्कृतम्සිංහලSimple EnglishSuomiSvenskaதமிழ்తెలుగుไทยУкраїнськаاردوTiếng Việt粵語中文  Edit links            ArticleTalk      English                  ReadView sourceView history        Tools      Tools move to sidebar hide    \t\tActions \t   ReadView sourceView history      \t\tGeneral \t   What links hereRelated changesUpload filePermanent linkPage informationCite this pageGet shortened URLDownload QR code      \t\tPrint/export \t   Download as PDFPrintable version      \t\tIn other projects \t   Wikimedia CommonsWikidata item                       Appearance move to sidebar hide            From Wikipedia, the free encyclopedia    Head of government of India For a list of prime ministers, see List of prime ministers of India.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Prime Minister of the Republic of IndiaBhāratīya PradhānamantrīLogo of the Prime Minister of IndiaFlag of IndiaIncumbentNarendra Modisince 26 May 2014Prime Minister's OfficeUnion Council of MinistersExecutive branch of the Indian GovernmentStyle The Honourable Mr.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Radhakrishnan  Deputy Speaker Harivansh Narayan Singh  Leader of the House Jagat Prakash Nadda (BJP)  Leader of the Opposition Mallikarjun Kharge (INC)  Secretary General Pramod Chandra Mody Ministry of Parliamentary Affairs Cabinet Minister Kiren Rijiju  Minister of State Arjun Ram Meghwal L.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Radhakrishnan  Prime Minister of India (List) Narendra Modi  Cabinet Secretary T.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://en.wikipedia.org/wiki/Narendra_Modi", "text": "RadhakrishnanPreceded byManmohan Singh    Additional ministries   IncumbentAssumed office 26 May 2014Ministry and DepartmentsPersonnel, Public Grievances and PensionsDepartment of SpaceDepartment of Atomic EnergyPreceded byManmohan Singh Leader of the House, Lok SabhaIncumbentAssumed office 26 May 2014DeputyGopinath MundeSushma SwarajRajnath SinghSpeakerSumitra MahajanOm BirlaPreceded bySushilkumar ShindeMember of Parliament, Lok SabhaIncumbentAssumed office 5 June 2014Preceded byMurli Manohar JoshiConstituencyVaranasi, Uttar PradeshChief Minister of GujaratIn office7 October 2001 – 22 May 2014Governor List Sunder Singh BhandariKailashpati MishraBalram JakharNawal Kishore SharmaS.", "source": "Narendra Modi - Wikipedia"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "Read More         Past Events          Transfer of 21st installment to more than 9 Crore PM-KISAN beneficiaries 19th November 2025 Location : Tamil Nadu Registration : 8594  Watch Now          Transfer of 20th installment to more than 9.7 Crore PM-KISAN beneficiaries 2nd August 2025 Location : Uttar Pradesh Registration : 8120  Watch Now          Transfer of 19th installment to more than 9.7 Crore PM-KISAN beneficiaries 24th February 2025 Location : Bihar Registration : 35431  Watch Now          PM-KISAN 18th Installment release by Hon’ble Prime Minister 5th October 2024 Location : Maharashtra Registration : 234  Watch Now          Distribution Sanction letters to 10 Lakh beneficiaries by Hon’ble Prime Minister 17th September 2024 Location : Odisha Registration : 71  Watch Now       View All            TransformingIndia MyGov Blog MyGov Quiz Pledge Campus Ambassador Saathi Contact Us Terms and Conditions MyGov     Follow Us MyGov Twitter MyGov Facebook MyGov YouTube MyGov Instagram MyGov WhatsApp MyGov LinkedIn MyGov Messenger         © Content owned, updated and maintained by the MyGov Cell.", "source": "PM Events – Prime Minister of India"}, {"url": "https://www.pmindia.gov.in/en/pms-profile/", "text": "Reference #18.16f3058b.1769946343.29013687 https://errors.edgesuite.net/18.16f3058b.1769946343.29013687", "source": "Know the PM | Prime Minister of India"}, {"url": "https://www.pmindia.gov.in/en/", "text": "Reference #18.2ef3058b.1769946352.1e022d14 https://errors.edgesuite.net/18.2ef3058b.1769946352.1e022d14", "source": "Prime Minister of India"}, {"url": "https://www.britannica.com/biography/Narendra-Modi", "text": "Select Citation Style  MLA APA Chicago Manual of Style       Copy Citation              \t                          Share              \t             Share          Share to social media  Facebook X  URL https://www.britannica.com/biography/Narendra-Modi       \t                         Feedback                          \t                         External Websites                           \t\t\tFeedback \t\t   \t\t\t\tCorrections?", "source": "Narendra Modi | Biography, Career, & Facts | Britannica"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Somanathan  Ministries Ministers Departments and Agencies Secretaries  Parliament Lok Sabha (18th) Speaker Om Birla  Deputy Speaker Vacant  Leader of the House Narendra Modi (BJP)  Leader of the Opposition Rahul Gandhi (INC)  Secretary General Utpal Kumar Singh  Rajya Sabha (Members) Chairman C.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "Subscribe now to receive updates on future events.", "source": "PM Events – Prime Minister of India"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "The JAM trinity (Jan Dhan- Aadhaar- Mobile) has led to elimination of middle-men and enhanced transparency.  The Pradhan Mantri Ujjwala Yojana has proven to be a major game-changer in providing smoke-free kitchens by providing free cooking gas connections to the poor.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019.", "source": "PM Events – Prime Minister of India"}, {"url": "https://pmevents.mygov.in/en/home/", "text": "This website belongs to MyGov, Ministry of Electronics & Information Technology, Government of India.", "source": "PM Events – Prime Minister of India"}, {"url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India", "text": "Venkataramani  Solicitor General Tushar Mehta  Additional Solicitor General  Law Commission National Judicial Appointments Commission National Legal Services Authority  Advocates General of the States   Elections and politics Election Commission Chief Election Commissioner Gyanesh Kumar  Election Commissioners Sukhbir Singh Sandhu Vivek Joshi  State Election Commission Elections Democracy Electoral College Electronic voting  Presidential elections  2012 2017 2022  Vice Presidential elections 2017 2022 2025  Lok Sabha elections (Constituencies) 2014 2019 2024  Rajya Sabha elections 2023 2024 2025  State Assembly elections 2020 2021 2022 2023 2024 2025  National coalitions NDA INDIA Political parties National parties State parties  Administrative divisions States and union territories (Capitals) States Andhra Pradesh Arunachal Pradesh Assam Bihar Chhattisgarh Goa Gujarat Haryana Himachal Pradesh Jharkhand Karnataka Kerala Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Odisha Punjab Rajasthan Sikkim Tamil Nadu Telangana Tripura Uttar Pradesh Uttarakhand West Bengal  Union territories Andaman and Nicobar Chandigarh Dadra and Nagar Haveli and Daman and Diu Delhi Jammu and Kashmir Ladakh Lakshadweep Puducherry  Proposed states and union territories  Autonomous Divisions Divisions Districts Sub-districts Community Development Block Metropolitan Areas Urban Agglomerations  Federalism Executive Governor List Lieutenant Governor/Administrator List Chief Minister List Deputy Chief Minister List Ministries Legislative Legislative Council Legislative Assembly Speaker List List Local Government Municipal Governance Municipal Corporation Municipality Town Panchayat  Panchayati Raj District Panchayat Block Panchayat Gram Panchayat  Foreign relations Ministry of External Affairs Cabinet Minister S.", "source": "Prime Minister of India - Wikipedia"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "When he became PM in 2014, India had a clear majority government after about 25 years.  With over 20 years in public life as a head of the national and state government, he has ushered in a paradigm shift in governance that has led to inclusive, development-oriented and corruption-free governance.", "source": "Narendra Modi | World Bank Live"}, {"url": "https://live.worldbank.org/en/experts/n/narendra-modi", "text": "‘Swachh Bharat Mission’ a mass movement for cleanliness across the nation has been lauded by WHO.  Under his leadership, India is making rapid strides in development of next-generation infrastructure be it in terms of more highways, railways, i-ways and waterways.", "source": "Narendra Modi | World Bank Live"}]